#№3
#01011,01+
#10100,11
#100000,000
print("TASK3: ",hex(32))
#  101011,1+
#  011111,100
#01001011,0
print("TASK3: ",hex(75))
#№4
#512x256xI = 70*1024*8*1,15
#16xI = 70*1,15
print("TASK4: ", 70*1.15/16)
#512x256xI = 103*1024*8*1,25
print(103*1024*8*1.25/512/256)
print("TASK4: ", 70*1.15/16)
#640x360xI = 450*1024B, 4b - fade
print("TASK4: ",450*1024*8/640/360 - 4)
#№6
# А П Р С У
# 0 1 2 3 4
# find(УСССС) = 43333
print("TASK6: ", int("43333", 5)+1)
# А В Е Н С
# 0 1 2 3 4
# find(АВАВ) = 01010 = 1010
print("TASK6: ", int("101", 5)+1)
# Е К М О П Р Т Ь
# 0 1 2 3 4 5 6 7
# ЬЬЬРР = 77755
print("TASK6:в ", int("77755", 8)+1)
#№7
#1111100000000000
#1000010111010000
print("TASK7: ",int("10111010000", 2))
#11000000
#10011101 =>
print("TASK7: ", int("11101",2))
#1110000000000000
#0111110001000011
print("TASK7: ", int("1110001000011", 2))
#№8
#f(n) = 12, d<60, 13d%12==1
mx = 0
for d in range(61):
    if 13*d%12==1: mx = d
print("TASK8: ",mx)
#f(n) = 24, d<40, 11d%24==1
mx = 0
for d in range(41):
    if 11*d%24==1: mx = d
print("TASK8: ",mx)
#№9
# 256symbols, alf = 1310 => i = 11, => 1iden = 11*256 = 2816b ~= 352B easy
print("TASK9: ",320*352/1024)
# 270symbols, alf = 1310 => i = 11, => 1iden = 11*270 = 2970b ~= 372B easy
print("TASK9: ",290*1024/372)
#№11
print("TASK11: ",int("11011010", 2))
print("TASK11: ",bin(231))

